tiborsimon/embedded-tdd-headers/pic/pic18/pic18lf44j50_tdd.h
#define GCEN2                         522
#define SSP2CON1                      523
#define SSP2CON1_SSPM                 524
#define SSP2CON1_SSPM0                525
#define SSPM02                        526
#define SSPM12                        527
#define SSP2CON1_SSPM1                528
#define SSP2CON1_SSPM2                529
#define SSPM22                        530
#define SSPM32                        531
#define SSP2CON1_SSPM3                532
#define SSP2CON1_CKP                  533
#define CKP2                          534
#define SSPEN2                        535
#define SSP2CON1_SSPEN                536
#define SSPOV2                        537
#define SSP2CON1_SSPOV                538
#define WCOL2                         539
#define SSP2CON1_WCOL                 540
#define SSP2STAT                      541
#define SSP2STAT_BF                   542
#define BF2                           543
#define SSP2STAT_UA                   544
#define UA2                           545
#define RW2                           546
#define READ_WRITE2                   547
#define nW2                           548
#define I2C_READ2                     549
#define SSP2STAT_R_NOT_W              550
#define R_nW2                         551
#define nWRITE2                       552
#define R_W2                          553
#define SSP2STAT_R_nW                 554
#define SSP2STAT_S                    555
#define S2                            556
#define START2                        557
#define I2C_START2                    558
#define P2                            559
#define SSP2STAT_P                    560
#define STOP2                         561
#define I2C_STOP2                     562
#define I2C_DAT2                      563
#define DATA_ADDRESS2                 564
#define SSP2STAT_D_NOT_A              565
#define D_A2                          566
#define SSP2STAT_D_nA                 567
#define nA2                           568
#define DA2                           569
#define nADDRESS2                     570
#define D_nA2                         571
#define SSP2STAT_CKE                  572
#define CKE2                          573
#define SSP2STAT_SMP                  574
#define SMP2                          575
#define SSP2ADD                       576
#define SSP2ADD_SSPADD                577
#define MSK02                         578
#define SSP2ADD_MSK0                  579
#define MSK12                         580
#define SSP2ADD_MSK1                  581
#define MSK22                         582
#define SSP2ADD_MSK2                  583
#define MSK32                         584
#define SSP2ADD_MSK3                  585
#define MSK42                         586
#define SSP2ADD_MSK4                  587
#define MSK52                         588
#define SSP2ADD_MSK5                  589
#define MSK62                         590
#define SSP2ADD_MSK6                  591
#define MSK72                         592
#define SSP2ADD_MSK7                  593
#define SSP2BUF                       594
#define SSP2BUF_SSPBUF                595
#define T4CON                         596
#define T4CKPS0                       597
#define T4CKPS                        598
#define T4CKPS1                       599
#define TMR4ON                        600
#define T4OUTPS                       601
#define T4OUTPS0                      602
#define T4OUTPS1                      603
#define T4OUTPS2                      604
#define T4OUTPS3                      605
#define PR4                           606
#define TMR4                          607
#define T3CON                         608
#define TMR3ON                        609
#define T3CON_RD16                    610
#define T3SYNC                        611
#define SOSCEN3                       612
#define T3OSCEN                       613
#define T3CKPS                        614
#define T3CKPS0                       615
#define T3CKPS1                       616
#define TMR3CS0                       617
#define TMR3CS                        618
#define TMR3CS1                       619
#define T3RD16                        620
#define RD163                         621
#define TMR3L                         622
#define TMR3H                         623
#define BAUDCON2                      624
#define ABDEN2                        625
#define BAUDCON2_ABDEN                626
#define WUE2                          627
#define BAUDCON2_WUE                  628
#define BRG162                        629
#define BAUDCON2_BRG16                630
#define SCKP2                         631
#define TXCKP2                        632
#define BAUDCON2_TXCKP                633
#define DTRXP2                        634
#define RXDTP2                        635
#define BAUDCON2_RXDTP                636
#define RCMT2                         637
#define RCIDL2                        638
#define BAUDCON2_RCIDL                639
#define BAUDCON2_ABDOVF               640
#define ABDOVF2                       641
#define SPBRGH2                       642
#define BAUDCON1                      643
#define BAUDCON1_ABDEN                644
#define ABDEN1                        645
#define BAUDCON1_WUE                  646
#define WUE1                          647
#define W4E                           648
#define BRG161                        649
#define BAUDCON1_BRG16                650
#define CKTXP                         651
#define BAUDCON1_TXCKP                652
#define SCKP1                         653
#define TXCKP1                        654
#define SCKP                          655
#define DTRXP1                        656
#define RXDTP1                        657
#define DTRXP                         658
#define RXCKP                         659
#define BAUDCON1_RXDTP                660
#define RCMT1                         661
#define RCIDL1                        662
#define BAUDCON1_RCIDL                663
#define RCMT                          664
#define ABDOVF1                       665
#define BAUDCON1_ABDOVF               666
#define SPBRGH1                       667
#define PORTA                         668
#define C1INA                         669
#define AN0                           670
#define ULPWUIN                       671
#define ULPWU                         672
#define RP0                           673
#define RA0                           674
#define PMA6                          675
#define PMA7                          676
#define AN1                           677
#define RP1                           678
#define RA1                           679
#define C2INA                         680
#define CVREF_MINUS                   681
#define AN2                           682
#define RA2                           683
#define VREF_MINUS                    684
#define C2INB                         685
#define C1INB                         686
#define AN3                           687
#define VREF_PLUS                     688
#define RA3                           689
#define RCV                           690
#define AN4                           691
#define LVDIN                         692
#define NOT_SS1                       693
#define RP2                           694
#define RA5                           695
#define nSS1                          696
#define HLVDIN                        697
#define CLKO                          698
#define RA6                           699
#define OSC2                          700
#define CLKI                          701
#define RJPU                          702
#define RA7                           703
#define OSC1                          704
#define PORTB                         705
#define RB0                           706
#define INT0                          707
#define RP3                           708
#define AN12                          709
#define RB1                           710
#define RP4                           711
#define PMPBE                         712
#define RTCC                          713
#define AN10                          714
#define REFO                          715
#define PMA3                          716
#define RP5                           717
#define AN8                           718
#define RB2                           719
#define CTEDG1                        720
#define VMO                           721
#define RP6                           722
#define PMA2                          723
#define AN9                           724
#define RB3                           725
#define VPO                           726
#define CCP2_PA2                      727
#define CTEDG2                        728
#define PMA1                          729
#define SCK1                          730
#define RB4                           731
#define RP7                           732
#define SCL1                          733
#define KBI0                          734
#define SDA1                          735
#define PMA0                          736
#define RB5                           737
#define RP8                           738
#define SDI1                          739
#define KBI1                          740
#define PGC                           741
#define RB6                           742
#define RP9                           743
#define KBI2                          744
#define PGD                           745
#define RB7                           746
#define RP10                          747
#define KBI3                          748
#define PORTC                         749
#define RP11                          750
#define T1OSO                         751
#define T1CK                          752
#define RC0                           753
#define CCP2                          754
#define NOT_UOE                       755
#define nUOE                          756
#define RP12                          757
#define T1OSI                         758
#define PA2                           759
#define RC1                           760
#define RP13                          761
#define CTPLS                         762
#define PA1                           763
#define RC2                           764
#define AN11                          765
#define D_MINUS                       766
#define VM                            767
#define RC4                           768
#define D_PLUS                        769
#define VP                            770
#define RC5                           771
#define PMA5                          772
#define RP17                          773
#define TX1                           774
#define RC6                           775
#define CK1                           776
#define PMA4                          777
#define SDO1                          778
#define RP18                          779
#define RX1                           780
#define RC7                           781
#define DT1                           782
#define PORTD                         783
#define RD0                           784
#define SCL2                          785
#define PMD0                          786
#define RD1                           787
#define SDA2                          788
#define PMD1                          789
#define RD2                           790
#define RP19                          791
#define PMD2                          792
#define RD3                           793
#define PMD3                          794
#define RP20                          795
#define RD4                           796
#define PMD4                          797
#define RP21                          798
#define RD5                           799
#define PMD5                          800
#define RP22                          801
#define RD6                           802
#define PMD6                          803
#define RP23                          804
#define SS2                           805
#define RD7                           806
#define PMD7                          807
#define RP24                          808
#define PORTE                         809
#define AN5                           810
#define PD2                           811
#define PMPRD                         812
#define RDE                           813
#define RE0                           814
#define AN6                           815
#define WRE                           816
#define RE1                           817
#define PMPWR                         818
#define PC2                           819
#define AN7                           820
#define CCP10                         821
#define PB2                           822
#define PMPCS                         823
#define CS                            824
#define RE2                           825
#define REPU                          826
#define CCP6E                         827
#define RE6                           828
#define PB1E                          829
#define RDPU                          830
#define CCP2E                         831
#define PA2E                          832
#define RE7                           833
#define HLVDCON                       834
#define HLVDL                         835
#define HLVDL0                        836
#define HLVDL1                        837
#define HLVDL2                        838
#define HLVDL3                        839
#define HLVDEN                        840
#define IRVST                         841
#define BGVST                         842
#define VDIRMAG                       843
#define DMACON2                       844
#define INTLVL0                       845
#define INTLVL                        846
#define INTLVL1                       847
#define INTLVL2                       848
#define INTLVL3                       849
#define DLYCYC                        850
#define DLYCYC0                       851
#define DLYCYC1                       852
#define DLYCYC2                       853
#define DLYCYC3                       854
#define DMACON1                       855
#define DMAEN                         856
#define DLYINTEN                      857
#define DUPLEX0                       858
#define DUPLEX1                       859
#define RXINC                         860
#define TXINC                         861
#define SSCON0                        862
#define SSCON1                        863
#define LATA                          864
#define LATA0                         865
#define LA0                           866
#define LATA1                         867
#define LA1                           868
#define LATA2                         869
#define LA2                           870
#define LATA3                         871
#define LA3                           872
#define LATA5                         873
#define LA5                           874
#define LATA6                         875
#define LA6                           876
#define LATA7                         877
#define LA7                           878
#define LATB                          879
#define LB0                           880
#define LATB0                         881
#define LB1                           882
#define LATB1                         883
#define LB2                           884
#define LATB2                         885
#define LB3                           886
#define LATB3                         887
#define LB4                           888
#define LATB4                         889
#define LB5                           890
#define LATB5                         891
#define LB6                           892
#define LATB6                         893
#define LB7                           894
#define LATB7                         895
#define LATC                          896
#define LATC0                         897
#define LC0                           898
#define LATC1                         899
#define LC1                           900
#define LATC2                         901
#define LC2                           902
#define LATC4                         903
#define LC4                           904
#define LATC5                         905
#define LC5                           906
#define LC6                           907
#define LATC6                         908
#define LATC7                         909
#define LC7                           910
#define LATD                          911
#define LATD0                         912
#define LD0                           913
#define LATD1                         914
#define LD1                           915
#define LATD2                         916
#define LD2                           917
#define LATD3                         918
#define LD3                           919
#define LATD4                         920
#define LD4                           921
#define LATD5                         922
#define LD5                           923
#define LATD6                         924
#define LD6                           925
#define LATD7                         926
#define LD7                           927
#define LATE                          928
#define LATE0                         929
#define LE0                           930
#define LATE1                         931
#define LE1                           932
#define LATE2                         933
#define LE2                           934
#define ALRMVALL                      935
#define ALRMVALH                      936
#define ALRMRPT                       937
#define ARPT0                         938
#define ARPT                          939
#define ARPT1                         940
#define ARPT2                         941
#define ARPT3                         942
#define ARPT4                         943
#define ARPT5                         944
#define ARPT6                         945
#define ARPT7                         946
#define ALRMCFG                       947
#define ALRMPTR                       948
#define ALRMPTR0                      949
#define ALRMPTR1                      950
#define AMASK0                        951
#define AMASK                         952
#define AMASK1                        953
#define AMASK2                        954
#define AMASK3                        955
#define CHIME                         956
#define ALRMEN                        957
#define TRISA                         958
#define TRISA0                        959
#define TRISA1                        960
#define TRISA2                        961
#define TRISA3                        962
#define TRISA5                        963
#define TRISA6                        964
#define TRISA7                        965
#define TRISB                         966
#define TRISB0                        967
#define TRISB1                        968
#define TRISB2                        969
#define TRISB3                        970
#define TRISB4                        971
#define TRISB5                        972
#define TRISB6                        973
#define TRISB7                        974
#define TRISC                         975
#define TRISC0                        976
#define TRISC1                        977
#define TRISC2                        978
#define TRISC4                        979
#define TRISC5                        980
#define TRISC6                        981
#define TRISC7                        982
#define TRISD                         983
#define TRISD0                        984
#define TRISD1                        985
#define TRISD2                        986
#define TRISD3                        987
#define TRISD4                        988
#define TRISD5                        989
#define TRISD6                        990
#define TRISD7                        991
#define TRISE                         992
#define TRISE0                        993
#define TRISE1                        994
#define TRISE2                        995
#define T3GCON                        996
#define T3GSS0                        997
#define T3GSS1                        998
#define T3GVAL                        999
#define T3GGO                         1000
#define T3DONE                        1001
#define T3GGO_T3DONE                  1002
#define T3GSPM                        1003
#define T3GTM                         1004
#define T3GPOL                        1005
#define TMR3GE                        1006
#define RTCVALL                       1007
#define RTCVALH_WAITE0                1008
#define RTCVALH                       1009
#define RTCVALH_WAITE1                1010
#define RTCVALH_WAITM0                1011
#define RTCVALH_WAITM1                1012
#define RTCVALH_WAITM2                1013
#define RTCVALH_WAITM3                1014
#define RTCVALH_WAITB0                1015
#define RTCVALH_WAITB1                1016
#define T1GCON                        1017
#define T1GSS0                        1018
#define T1GSS1                        1019
#define T1GVAL                        1020
#define T1DONE                        1021
#define T1GGO_T1DONE                  1022
#define T1GGO                         1023
#define T1GSPM                        1024
#define T1GTM                         1025
#define T1GPOL                        1026
#define TMR1GE                        1027
#define OSCTUNE                       1028
#define TUN0                          1029
#define TUN                           1030
#define TUN1                          1031
#define TUN2                          1032
#define TUN3                          1033
#define TUN4                          1034
#define TUN5                          1035
#define PLLEN                         1036
#define INTSRC                        1037
#define RCSTA2                        1038
#define RCD82                         1039
#define RX9D2                         1040
#define RCSTA2_RX9D                   1041
#define OERR2                         1042
#define RCSTA2_OERR                   1043
#define FERR2                         1044
#define RCSTA2_FERR                   1045
#define ADDEN2                        1046
#define RCSTA2_ADDEN                  1047
#define RCSTA2_CREN                   1048
#define CREN2                         1049
#define SREN2                         1050
#define RCSTA2_SREN                   1051
#define RC92                          1052
#define RC8_92                        1053
#define RCSTA2_RX9                    1054
#define RX92                          1055
#define RCSTA2_SPEN                   1056
#define SPEN2                         1057
#define PIE1                          1058
#define TMR1IE                        1059
#define TMR2IE                        1060
#define CCP1IE                        1061
#define SSP1IE                        1062
#define SSPIE                         1063
#define TXIE                          1064
#define TX1IE                         1065
#define RC1IE                         1066
#define RCIE                          1067
#define ADIE                          1068
#define PSPIE                         1069
#define PMPIE                         1070
#define PIR1                          1071
#define TMR1IF                        1072
#define TMR2IF                        1073
#define CCP1IF                        1074
#define SSPIF                         1075
#define SSP1IF                        1076
#define TXIF                          1077
#define TX1IF                         1078
#define RCIF                          1079
#define RC1IF                         1080
#define ADIF                          1081
#define PSPIF                         1082
#define PMPIF                         1083
#define IPR1                          1084
#define TMR1IP                        1085
#define TMR2IP                        1086
#define CCP1IP                        1087
#define SSPIP                         1088
#define SSP1IP                        1089
#define TX1IP                         1090
