tiborsimon/embedded-tdd-headers/pic/pic18/pic18lf44j50_tdd.h
#define TXIP                          1091
#define RCIP                          1092
#define RC1IP                         1093
#define ADIP                          1094
#define PMPIP                         1095
#define PSPIP                         1096
#define PIE2                          1097
#define CCP2IE                        1098
#define TMR3IE                        1099
#define LVDIE                         1100
#define BCL1IE                        1101
#define BCLIE                         1102
#define USBIE                         1103
#define CM1IE                         1104
#define CMIE                          1105
#define CM2IE                         1106
#define OSCFIE                        1107
#define PIR2                          1108
#define CCP2IF                        1109
#define TMR3IF                        1110
#define LVDIF                         1111
#define BCL1IF                        1112
#define BCLIF                         1113
#define USBIF                         1114
#define CM1IF                         1115
#define CMIF                          1116
#define CM2IF                         1117
#define OSCFIF                        1118
#define IPR2                          1119
#define CCP2IP                        1120
#define TMR3IP                        1121
#define LVDIP                         1122
#define BCLIP                         1123
#define BCL1IP                        1124
#define USBIP                         1125
#define CM1IP                         1126
#define CM2IP                         1127
#define CMIP                          1128
#define OSCFIP                        1129
#define PIE3                          1130
#define RTCCIE                        1131
#define RXB0IE                        1132
#define RXBNIE                        1133
#define TMR3GIE                       1134
#define RXB1IE                        1135
#define CTMUIE                        1136
#define TXB0IE                        1137
#define TMR4IE                        1138
#define TXB1IE                        1139
#define TXB2IE                        1140
#define TXBNIE                        1141
#define TX2IE                         1142
#define RC2IE                         1143
#define BCL2IE                        1144
#define SSP2IE                        1145
#define PIR3                          1146
#define RTCCIF                        1147
#define RXBNIF                        1148
#define TMR3GIF                       1149
#define CTMUIF                        1150
#define TMR4IF                        1151
#define TXBNIF                        1152
#define TX2IF                         1153
#define RC2IF                         1154
#define BCL2IF                        1155
#define SSP2IF                        1156
#define IPR3                          1157
#define RTCCIP                        1158
#define TMR3GIP                       1159
#define RXBNIP                        1160
#define CTMUIP                        1161
#define TMR4IP                        1162
#define TX2IP                         1163
#define TXBNIP                        1164
#define RC2IP                         1165
#define BCL2IP                        1166
#define SSP2IP                        1167
#define EECON1                        1168
#define WR                            1169
#define WREN                          1170
#define WRERR                         1171
#define FREE                          1172
#define WPROG                         1173
#define EECON2                        1174
#define TXSTA2                        1175
#define TX9D2                         1176
#define TXSTA2_TX9D                   1177
#define TXD82                         1178
#define TRMT2                         1179
#define TXSTA2_TRMT                   1180
#define BRGH2                         1181
#define TXSTA2_BRGH                   1182
#define SENDB2                        1183
#define TXSTA2_SENDB                  1184
#define TXSTA2_SYNC                   1185
#define SYNC2                         1186
#define TXEN2                         1187
#define TXSTA2_TXEN                   1188
#define TX8_92                        1189
#define TX92                          1190
#define TXSTA2_TX9                    1191
#define TXSTA2_CSRC                   1192
#define CSRC2                         1193
#define TXREG2                        1194
#define RCREG2                        1195
#define SPBRG2                        1196
#define RCSTA1                        1197
#define RCSTA1_RX9D                   1198
#define RX9D1                         1199
#define RCD8                          1200
#define RCSTA1_OERR                   1201
#define OERR1                         1202
#define RCSTA1_FERR                   1203
#define FERR1                         1204
#define RCSTA1_ADDEN                  1205
#define ADDEN1                        1206
#define ADEN                          1207
#define RCSTA1_CREN                   1208
#define CREN1                         1209
#define SRENA                         1210
#define SREN1                         1211
#define RCSTA1_SREN                   1212
#define RC8_9                         1213
#define RCSTA1_RX9                    1214
#define nRC8                          1215
#define NOT_RC8                       1216
#define RC9                           1217
#define RX91                          1218
#define RCSTA1_SPEN                   1219
#define SPEN1                         1220
#define TXSTA1                        1221
#define TX9D1                         1222
#define TXSTA1_TX9D                   1223
#define TXD8                          1224
#define TRMT1                         1225
#define TXSTA1_TRMT                   1226
#define BRGH1                         1227
#define TXSTA1_BRGH                   1228
#define TXSTA1_SENDB                  1229
#define SENDB1                        1230
#define TXSTA1_SYNC                   1231
#define SYNC1                         1232
#define TXEN1                         1233
#define TXSTA1_TXEN                   1234
#define TX91                          1235
#define TX8_9                         1236
#define NOT_TX8                       1237
#define nTX8                          1238
#define TXSTA1_TX9                    1239
#define TXSTA1_CSRC                   1240
#define CSRC1                         1241
#define TXREG1                        1242
#define RCREG1                        1243
#define SPBRG1                        1244
#define CTMUICON                      1245
#define IRNG                          1246
#define IRNG0                         1247
#define IRNG1                         1248
#define ITRIM0                        1249
#define ITRIM                         1250
#define ITRIM1                        1251
#define ITRIM2                        1252
#define ITRIM3                        1253
#define ITRIM4                        1254
#define ITRIM5                        1255
#define CTMUCONL                      1256
#define EDG1STAT                      1257
#define EDG2STAT                      1258
#define EDG1SEL                       1259
#define EDG1SEL0                      1260
#define EDG1SEL1                      1261
#define EDG1POL                       1262
#define EDG2SEL0                      1263
#define EDG2SEL                       1264
#define EDG2SEL1                      1265
#define EDG2POL                       1266
#define CTMUCONH                      1267
#define CTTRIG                        1268
#define IDISSEN                       1269
#define EDGSEQEN                      1270
#define EDGEN                         1271
#define TGEN                          1272
#define CTMUSIDL                      1273
#define CTMUEN                        1274
#define CCP2CON                       1275
#define CCP2M                         1276
#define CCP2M0                        1277
#define CCP2M1                        1278
#define CCP2M2                        1279
#define CCP2M3                        1280
#define DC2B                          1281
#define DC2B0                         1282
#define CCP2Y                         1283
#define DC2B1                         1284
#define CCP2X                         1285
#define P2M                           1286
#define P2M0                          1287
#define P2M1                          1288
#define CCPR2L                        1289
#define CCPR2H                        1290
#define ECCP2DEL                      1291
#define ECCP2DEL_P2DC0                1292
#define P2DC                          1293
#define ECCP2DEL_P2DC1                1294
#define ECCP2DEL_P2DC2                1295
#define ECCP2DEL_P2DC3                1296
#define ECCP2DEL_P2DC4                1297
#define ECCP2DEL_P2DC5                1298
#define ECCP2DEL_P2DC6                1299
#define P2RSEN                        1300
#define PSS2BD                        1301
#define PSS2BD0                       1302
#define PSS2BD1                       1303
#define PSS2AC0                       1304
#define PSS2AC                        1305
#define PSS2AC1                       1306
#define ECCP2AS0                      1307
#define ECCP2AS                       1308
#define ECCP2AS1                      1309
#define ECCP2AS2                      1310
#define ECCP2ASE                      1311
#define PSTR2CON                      1312
#define PSTR2CON_STRA                 1313
#define P2DC02                        1314
#define STRA2                         1315
#define P2DC0CON                      1316
#define PSTR2CON_P2DC0                1317
#define STRB2                         1318
#define P2DC12                        1319
#define PSTR2CON_STRB                 1320
#define PSTR2CON_P2DC1                1321
#define P2DC1CON                      1322
#define PSTR2CON_STRC                 1323
#define STRC2                         1324
#define PSTR2CON_P2DC2                1325
#define P2DC22                        1326
#define P2DC2CON                      1327
#define P2DC32                        1328
#define STRD2                         1329
#define PSTR2CON_STRD                 1330
#define P2DC3CON                      1331
#define PSTR2CON_P2DC3                1332
#define P2DC4CON                      1333
#define STRSYNC2                      1334
#define PSTR2CON_STRSYNC              1335
#define PSTR2CON_P2DC4                1336
#define P2DC42                        1337
#define P2DC52                        1338
#define P2DC5CON                      1339
#define PSTR2CON_P2DC5                1340
#define P2DC6CON                      1341
#define CMPL02                        1342
#define PSTR2CON_P2DC6                1343
#define P2DC62                        1344
#define PSTR2CON_CMPL0                1345
#define CMPL12                        1346
#define PSTR2CON_CMPL1                1347
#define CCP1CON                       1348
#define CCP1M0                        1349
#define CCP1M                         1350
#define CCP1M1                        1351
#define CCP1M2                        1352
#define CCP1M3                        1353
#define CCP1Y                         1354
#define DC1B                          1355
#define DC1B0                         1356
#define CCP1X                         1357
#define DC1B1                         1358
#define P1M                           1359
#define P1M0                          1360
#define P1M1                          1361
#define CCPR1L                        1362
#define CCPR1H                        1363
#define ECCP1DEL                      1364
#define P1DC                          1365
#define P1DC0                         1366
#define P1DC1                         1367
#define P1DC2                         1368
#define P1DC3                         1369
#define P1DC4                         1370
#define P1DC5                         1371
#define P1DC6                         1372
#define P1RSEN                        1373
#define PSS1BD0                       1374
#define PSS1BD                        1375
#define PSS1BD1                       1376
#define PSS1AC                        1377
#define PSS1AC0                       1378
#define PSS1AC1                       1379
#define ECCP1AS                       1380
#define ECCP1AS0                      1381
#define ECCP1AS1                      1382
#define ECCP1AS2                      1383
#define ECCP1ASE                      1384
#define PSTR1CON                      1385
#define PSTR1CON_STRA                 1386
#define PSTR1CON_STRB                 1387
#define PSTR1CON_STRC                 1388
#define PSTR1CON_STRD                 1389
#define PSTR1CON_STRSYNC              1390
#define PSTR1CON_CMPL0                1391
#define PSTR1CON_CMPL1                1392
#define WDTCON                        1393
#define SWDTEN                        1394
#define SWDTE                         1395
#define ULPSINK                       1396
#define ULPEN                         1397
#define DS                            1398
#define ULPLVL                        1399
#define LVDSTAT                       1400
#define REGSLP                        1401
#define ADCON1                        1402
#define ADCS0                         1403
#define ADCS                          1404
#define ADCS1                         1405
#define ADCS2                         1406
#define ACQT0                         1407
#define ACQT                          1408
#define CHSN3                         1409
#define ACQT1                         1410
#define VCFG01                        1411
#define ACQT2                         1412
#define VCFG11                        1413
#define ADCON1_ADCAL                  1414
#define ADFM                          1415
#define ADCON0                        1416
#define ADON                          1417
#define nDONE                         1418
#define GO_nDONE                      1419
#define NOT_DONE                      1420
#define GODONE                        1421
#define GO_DONE                       1422
#define DONE                          1423
#define GO                            1424
#define GO_NOT_DONE                   1425
#define CHS                           1426
#define CHS0                          1427
#define CHS1                          1428
#define CHS2                          1429
#define CHS3                          1430
#define VCFG                          1431
#define VCFG0                         1432
#define VCFG1                         1433
#define ADCON0_ADCAL                  1434
#define ADRESL                        1435
#define ADRESH                        1436
#define SSP1CON2                      1437
#define SEN1                          1438
#define SSP1CON2_SEN                  1439
#define ADMSK11                       1440
#define SSP1CON2_RSEN                 1441
#define RSEN1                         1442
#define SSP1CON2_ADMSK1               1443
#define SSP1CON2_PEN                  1444
#define ADMSK21                       1445
#define PEN1                          1446
#define SSP1CON2_ADMSK2               1447
#define ADMSK31                       1448
#define RCEN1                         1449
#define SSP1CON2_RCEN                 1450
#define SSP1CON2_ADMSK3               1451
#define SSP1CON2_ACKEN                1452
#define ACKEN1                        1453
#define ADMSK41                       1454
#define SSP1CON2_ADMSK4               1455
#define ACKDT1                        1456
#define ADMSK51                       1457
#define SSP1CON2_ACKDT                1458
#define SSP1CON2_ADMSK5               1459
#define SSP1CON2_ACKSTAT              1460
#define ACKSTAT1                      1461
#define GCEN1                         1462
#define SSP1CON2_GCEN                 1463
#define SSP1CON1                      1464
#define SSP1CON1_SSPM0                1465
#define SSPM01                        1466
#define SSP1CON1_SSPM                 1467
#define SSP1CON1_SSPM1                1468
#define SSPM11                        1469
#define SSP1CON1_SSPM2                1470
#define SSPM21                        1471
#define SSPM31                        1472
#define SSP1CON1_SSPM3                1473
#define SSP1CON1_CKP                  1474
#define CKP1                          1475
#define SSPEN1                        1476
#define SSP1CON1_SSPEN                1477
#define SSPOV1                        1478
#define SSP1CON1_SSPOV                1479
#define WCOL1                         1480
#define SSP1CON1_WCOL                 1481
#define SSP1STAT                      1482
#define BF1                           1483
#define SSP1STAT_BF                   1484
#define SSP1STAT_UA                   1485
#define UA1                           1486
#define SSP1STAT_R_NOT_W              1487
#define RW1                           1488
#define R_nW1                         1489
#define READ_WRITE                    1490
#define R_NOT_W1                      1491
#define NOT_W                         1492
#define I2C_READ                      1493
#define D_A1                          1494
#define nW                            1495
#define NOT_W1                        1496
#define READ_WRITE1                   1497
#define RW                            1498
#define nW1                           1499
#define SSP1STAT_R_nW                 1500
#define R1                            1501
#define nWRITE1                       1502
#define I2C_READ1                     1503
#define nWRITE                        1504
#define R                             1505
#define NOT_WRITE                     1506
#define R_W                           1507
#define NOT_WRITE1                    1508
#define SSP1STAT_S                    1509
#define S1                            1510
#define START                         1511
#define START1                        1512
#define I2C_START1                    1513
#define I2C_START                     1514
#define SSP1STAT_P                    1515
#define STOP1                         1516
#define I2C_STOP                      1517
#define P1                            1518
#define I2C_STOP1                     1519
#define STOP                          1520
#define D_nA1                         1521
#define NOT_A                         1522
#define SSP1STAT_D_nA                 1523
#define SSP1STAT_D_NOT_A              1524
#define DA                            1525
#define DATA_ADDRESS1                 1526
#define nA                            1527
#define D_A                           1528
#define nADDRESS1                     1529
#define D                             1530
#define DA1                           1531
#define NOT_A1                        1532
#define NOT_ADDRESS1                  1533
#define DATA_ADDRESS                  1534
#define I2C_DAT1                      1535
#define NOT_ADDRESS                   1536
#define nADDRESS                      1537
#define R_W1                          1538
#define nA1                           1539
#define I2C_DAT                       1540
#define D_NOT_A1                      1541
#define D1                            1542
#define CKE1                          1543
#define SSP1STAT_CKE                  1544
#define SMP1                          1545
#define SSP1STAT_SMP                  1546
#define SSP1ADD                       1547
#define SSP1ADD_SSPADD                1548
#define SSP1ADD_MSK0                  1549
#define MSK01                         1550
#define SSP1ADD_MSK1                  1551
#define MSK11                         1552
#define SSP1ADD_MSK2                  1553
#define MSK21                         1554
#define MSK31                         1555
#define SSP1ADD_MSK3                  1556
#define SSP1ADD_MSK4                  1557
#define MSK41                         1558
#define MSK51                         1559
#define SSP1ADD_MSK5                  1560
#define SSP1ADD_MSK6                  1561
#define MSK61                         1562
#define MSK71                         1563
#define SSP1ADD_MSK7                  1564
#define SSP1BUF                       1565
#define SSP1BUF_SSPBUF                1566
#define T2CON                         1567
#define T2CKPS0                       1568
#define T2CKPS                        1569
#define T2CKPS1                       1570
#define TMR2ON                        1571
#define T2OUTPS0                      1572
#define T2OUTPS                       1573
#define T2OUTPS1                      1574
#define T2OUTPS2                      1575
#define T2OUTPS3                      1576
#define WM0                           1577
#define PR2                           1578
#define WM1                           1579
#define WAIT0                         1580
#define WAIT1                         1581
#define EBDIS                         1582
#define TMR2                          1583
#define T1CON                         1584
#define TMR1ON                        1585
#define T1CON_RD16                    1586
#define RD161                         1587
#define T1SYNC                        1588
#define T1SYNC1                       1589
#define T1OSCEN                       1590
#define T1OSCEN1                      1591
#define SOSCEN                        1592
#define T1CKPS0                       1593
#define T1CKPS01                      1594
#define T1CKPS                        1595
#define T1CKPS1                       1596
#define T1CKPS11                      1597
#define TMR1CS0                       1598
#define TMR1CS                        1599
#define TMR1CS01                      1600
#define T1RD16                        1601
#define TMR1CS11                      1602
#define TMR1CS1                       1603
#define TMR1L                         1604
#define TMR1H                         1605
#define RCON                          1606
#define BOR                           1607
#define NOT_BOR                       1608
#define nBOR                          1609
#define POR                           1610
#define nPOR                          1611
#define NOT_POR                       1612
#define PD                            1613
#define nPD                           1614
#define NOT_PD                        1615
#define nTO                           1616
#define TO                            1617
#define NOT_TO                        1618
#define nRI                           1619
#define NOT_RI                        1620
#define RI                            1621
#define NOT_CM                        1622
#define CM                            1623
#define nCM                           1624
#define IPEN                          1625
#define CM2CON                        1626
#define CM2CON_CCH                    1627
#define CM2CON_CCH0                   1628
#define CCH02                         1629
#define CCH12                         1630
#define CM2CON_CCH1                   1631
#define CM2CON_CREF                   1632
#define CREF2                         1633
#define CM2CON_EVPOL                  1634
#define EVPOL02                       1635
#define CM2CON_EVPOL0                 1636
#define EVPOL12                       1637
#define CM2CON_EVPOL1                 1638
#define CM2CON_CPOL                   1639
#define CPOL2                         1640
#define CM2CON_COE                    1641
#define COE2                          1642
#define CM2CON_CON                    1643
#define CON2                          1644
#define CM1CON                        1645
#define CM1CON_CCH                    1646
#define C1CH0                         1647
#define CM1CON_CCH0                   1648
